In [1]:
people = {'name':['jane','mercy','joy','Adam'],
         'last':['dan','stev','stev','Oliver'],
         'email':['janedan@gmail.com','mercystev@gmail.com','joygath@gmail.com','adamoliver@email.com']}

In [2]:
people['email']

['janedan@gmail.com',
 'mercystev@gmail.com',
 'joygath@gmail.com',
 'adamoliver@email.com']

In [3]:
## to create a pd data frame using this dictionary
import pandas as pd

In [4]:
df = pd.DataFrame(people)
df

    name    last                 email
0   jane     dan     janedan@gmail.com
1  mercy    stev   mercystev@gmail.com
2    joy    stev     joygath@gmail.com
3   Adam  Oliver  adamoliver@email.com

In [5]:
df['email']

0       janedan@gmail.com
1     mercystev@gmail.com
2       joygath@gmail.com
3    adamoliver@email.com
Name: email, dtype: object

In [6]:
df[['name','email']]

    name                 email
0   jane     janedan@gmail.com
1  mercy   mercystev@gmail.com
2    joy     joygath@gmail.com
3   Adam  adamoliver@email.com

In [7]:
type(df['email'])

pandas.core.series.Series

In [8]:
df.columns

Index(['name', 'last', 'email'], dtype='object')

In [9]:
#to get rows we use loc and iloc
#iloc allows us to ascess data using integers
df.iloc[0]
#gives all the data contain in the first row

name                  jane
last                   dan
email    janedan@gmail.com
Name: 0, dtype: object

In [10]:
df.iloc[[0,1],0:3]

    name  last                email
0   jane   dan    janedan@gmail.com
1  mercy  stev  mercystev@gmail.com

In [11]:
df.loc[0]

name                  jane
last                   dan
email    janedan@gmail.com
Name: 0, dtype: object

In [12]:
df.loc[[0,1],'email']

0      janedan@gmail.com
1    mercystev@gmail.com
Name: email, dtype: object

In [13]:
df.loc[[0,1],['last','email']]

   last                email
0   dan    janedan@gmail.com
1  stev  mercystev@gmail.com

### indexes

In [14]:
df

    name    last                 email
0   jane     dan     janedan@gmail.com
1  mercy    stev   mercystev@gmail.com
2    joy    stev     joygath@gmail.com
3   Adam  Oliver  adamoliver@email.com

In [15]:
df['email']

0       janedan@gmail.com
1     mercystev@gmail.com
2       joygath@gmail.com
3    adamoliver@email.com
Name: email, dtype: object

In [16]:
#to set the email column as the index
df.set_index('email',inplace=True)

In [17]:
df.index

Index(['janedan@gmail.com', 'mercystev@gmail.com', 'joygath@gmail.com',
       'adamoliver@email.com'],
      dtype='object', name='email')

In [18]:
df.loc['janedan@gmail.com']

name    jane
last     dan
Name: janedan@gmail.com, dtype: object

In [19]:
#to rest ou index
df.reset_index('email',inplace=True)

In [20]:
df

                  email   name    last
0     janedan@gmail.com   jane     dan
1   mercystev@gmail.com  mercy    stev
2     joygath@gmail.com    joy    stev
3  adamoliver@email.com   Adam  Oliver

In [21]:
#filtering data
filt = df['last'] == 'stev'

In [22]:
df[filt]

                 email   name  last
1  mercystev@gmail.com  mercy  stev
2    joygath@gmail.com    joy  stev

In [23]:
#or
df[df['last'] == 'stev']

                 email   name  last
1  mercystev@gmail.com  mercy  stev
2    joygath@gmail.com    joy  stev

In [24]:
#or  using the .loc

In [25]:
#or
df.loc[filt]

                 email   name  last
1  mercystev@gmail.com  mercy  stev
2    joygath@gmail.com    joy  stev

In [26]:
#to get the email of the filtered column having last name as stev
df.loc[df['last'] == 'stev','email']
#the first elements are the rows we want the second is the column

1    mercystev@gmail.com
2      joygath@gmail.com
Name: email, dtype: object

In [27]:
#or
df.loc[filt,'email']

1    mercystev@gmail.com
2      joygath@gmail.com
Name: email, dtype: object

In [28]:
#using and(&) and or(|) for filtering
filt = (df['last'] == 'stev')| (df['name'] == 'jane')
df.loc[filt]

                 email   name  last
0    janedan@gmail.com   jane   dan
1  mercystev@gmail.com  mercy  stev
2    joygath@gmail.com    joy  stev

In [29]:
filt = (df['last'] == 'stev')& (df['name'] == 'joy')
df.loc[filt]

               email name  last
2  joygath@gmail.com  joy  stev

In [30]:
filt = (df['last'] == 'stev')& (df['name'] == 'joy')
df.loc[~filt]

                  email   name    last
0     janedan@gmail.com   jane     dan
1   mercystev@gmail.com  mercy    stev
3  adamoliver@email.com   Adam  Oliver

In [31]:
#or 
df.loc[(df['last'] == 'stev')| (df['name'] == 'jane')]

                 email   name  last
0    janedan@gmail.com   jane   dan
1  mercystev@gmail.com  mercy  stev
2    joygath@gmail.com    joy  stev

## modifying data

In [32]:
#renaming column
df.columns = ['email','first name','last name']

In [33]:
df.columns

Index(['email', 'first name', 'last name'], dtype='object')

In [34]:
## to uppercase all of the column names
df.columns = [x.lower() for x in df.columns]
df

                  email first name last name
0     janedan@gmail.com       jane       dan
1   mercystev@gmail.com      mercy      stev
2     joygath@gmail.com        joy      stev
3  adamoliver@email.com       Adam    Oliver

In [35]:
 #to remove spaces and replace with underscore for column name
df.columns = df.columns.str.replace(' ','_')
df

                  email first_name last_name
0     janedan@gmail.com       jane       dan
1   mercystev@gmail.com      mercy      stev
2     joygath@gmail.com        joy      stev
3  adamoliver@email.com       Adam    Oliver

In [36]:
#to rename our column
df.rename(columns={'first_name':'fname','last_name':'lastname'},inplace=True)
df

                  email  fname lastname
0     janedan@gmail.com   jane      dan
1   mercystev@gmail.com  mercy     stev
2     joygath@gmail.com    joy     stev
3  adamoliver@email.com   Adam   Oliver

In [37]:
#modifying rows
df.loc[2] = ['janetsamson@gmail.com','janet','samson']
df

                   email  fname lastname
0      janedan@gmail.com   jane      dan
1    mercystev@gmail.com  mercy     stev
2  janetsamson@gmail.com  janet   samson
3   adamoliver@email.com   Adam   Oliver

In [38]:
#to mosify a specific column of a given row
df.loc[2,['email','lastname']]

email       janetsamson@gmail.com
lastname                   samson
Name: 2, dtype: object

In [39]:
df.loc[1,['email','lastname']]=['kylemercy@email.com','Doe']
df

                   email  fname lastname
0      janedan@gmail.com   jane      dan
1    kylemercy@email.com  mercy      Doe
2  janetsamson@gmail.com  janet   samson
3   adamoliver@email.com   Adam   Oliver

In [40]:
df.loc[2,'lastname'] ='Smith'
df

                   email  fname lastname
0      janedan@gmail.com   jane      dan
1    kylemercy@email.com  mercy      Doe
2  janetsamson@gmail.com  janet    Smith
3   adamoliver@email.com   Adam   Oliver

In [41]:
#using at to remame inplace of loc
df.at[2,'lastname'] ='Doe'
df

                   email  fname lastname
0      janedan@gmail.com   jane      dan
1    kylemercy@email.com  mercy      Doe
2  janetsamson@gmail.com  janet      Doe
3   adamoliver@email.com   Adam   Oliver

In [42]:
df['email'] = df['email'].str.lower()
df

                   email  fname lastname
0      janedan@gmail.com   jane      dan
1    kylemercy@email.com  mercy      Doe
2  janetsamson@gmail.com  janet      Doe
3   adamoliver@email.com   Adam   Oliver

In [43]:
## for methods use to modify data

### one APPLY

In [44]:
## apply is use for calling a fuctions on our value for either a series or dataframe
#for a series
df['email'].apply(len)

0    17
1    19
2    21
3    20
Name: email, dtype: int64

In [45]:
#to create a fuction that returns an uppercase of our email
def email_upper(email):
    return email.upper()

In [46]:
#to apply this function to our emailcolumn
df['email'].apply(email_upper)

0        JANEDAN@GMAIL.COM
1      KYLEMERCY@EMAIL.COM
2    JANETSAMSON@GMAIL.COM
3     ADAMOLIVER@EMAIL.COM
Name: email, dtype: object

In [47]:
df.apply(len)

email       4
fname       4
lastname    4
dtype: int64

## TWO APPLYMAP

In [48]:
df.applymap(len)

   email  fname  lastname
0     17      4         3
1     19      5         3
2     21      5         3
3     20      4         6

In [49]:
df.applymap(str.lower)

                   email  fname lastname
0      janedan@gmail.com   jane      dan
1    kylemercy@email.com  mercy      doe
2  janetsamson@gmail.com  janet      doe
3   adamoliver@email.com   adam   oliver

##THREE MAP

In [50]:
#map method only works on a series
df['fname'].map({'jane':'mary','mercy':'chris'})

0     mary
1    chris
2      NaN
3      NaN
Name: fname, dtype: object

## REPALCE

In [51]:
# rather than using map we use replace to prvent print the nan value
df['fname'].replace({'jane':'mary','mercy':'chris'})

0     mary
1    chris
2    janet
3     Adam
Name: fname, dtype: object

### adding and removing rows and columns

In [52]:
df['fullname'] = df['fname'] + ' ' + df['lastname']
df

                   email  fname lastname     fullname
0      janedan@gmail.com   jane      dan     jane dan
1    kylemercy@email.com  mercy      Doe    mercy Doe
2  janetsamson@gmail.com  janet      Doe    janet Doe
3   adamoliver@email.com   Adam   Oliver  Adam Oliver

In [53]:
# removing column
df.drop(columns=['fname','lastname'],inplace =True)

In [54]:
#to split the fullname
df['fullname'].str.split(' ',expand=True)

       0       1
0   jane     dan
1  mercy     Doe
2  janet     Doe
3   Adam  Oliver

In [55]:
#to assign the values to first and last
df[['first','last']] = df['fullname'].str.split(' ',expand=True)
df

                   email     fullname  first    last
0      janedan@gmail.com     jane dan   jane     dan
1    kylemercy@email.com    mercy Doe  mercy     Doe
2  janetsamson@gmail.com    janet Doe  janet     Doe
3   adamoliver@email.com  Adam Oliver   Adam  Oliver

In [56]:
#addind a single row of data
df.append({'first':'Tony'},ignore_index=True)
#ignore_index=True this is use to ignore the index to avoid error

C:\Users\MERCY\AppData\Local\Temp\ipykernel_6344\2783702382.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first':'Tony'},ignore_index=True)

                   email     fullname  first    last
0      janedan@gmail.com     jane dan   jane     dan
1    kylemercy@email.com    mercy Doe  mercy     Doe
2  janetsamson@gmail.com    janet Doe  janet     Doe
3   adamoliver@email.com  Adam Oliver   Adam  Oliver
4                    NaN          NaN   Tony     NaN

In [57]:
df.append({'first':'Tony','last':'jonny'},ignore_index=True)

C:\Users\MERCY\AppData\Local\Temp\ipykernel_6344\3841789011.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first':'Tony','last':'jonny'},ignore_index=True)

                   email     fullname  first    last
0      janedan@gmail.com     jane dan   jane     dan
1    kylemercy@email.com    mercy Doe  mercy     Doe
2  janetsamson@gmail.com    janet Doe  janet     Doe
3   adamoliver@email.com  Adam Oliver   Adam  Oliver
4                    NaN          NaN   Tony   jonny

In [58]:
people = {'name':['Tony','steve'],
         'last':['Stark','Rogers'],
         'email':['tonystark@avengers.com','stevrogers@avengers.com']}

In [59]:
df2 =pd.DataFrame(people)
df2

    name    last                    email
0   Tony   Stark   tonystark@avengers.com
1  steve  Rogers  stevrogers@avengers.com

In [60]:
#to make our change permnant
df =df.append(df2,ignore_index=True)
df

C:\Users\MERCY\AppData\Local\Temp\ipykernel_6344\1853680762.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df =df.append(df2,ignore_index=True)

                     email     fullname  first    last   name
0        janedan@gmail.com     jane dan   jane     dan    NaN
1      kylemercy@email.com    mercy Doe  mercy     Doe    NaN
2    janetsamson@gmail.com    janet Doe  janet     Doe    NaN
3     adamoliver@email.com  Adam Oliver   Adam  Oliver    NaN
4   tonystark@avengers.com          NaN    NaN   Stark   Tony
5  stevrogers@avengers.com          NaN    NaN  Rogers  steve

In [61]:
#removing rows
df.drop(index=4)

                     email     fullname  first    last   name
0        janedan@gmail.com     jane dan   jane     dan    NaN
1      kylemercy@email.com    mercy Doe  mercy     Doe    NaN
2    janetsamson@gmail.com    janet Doe  janet     Doe    NaN
3     adamoliver@email.com  Adam Oliver   Adam  Oliver    NaN
5  stevrogers@avengers.com          NaN    NaN  Rogers  steve

In [62]:
#droping using condition
filt=df['last'] == 'Doe'
df.drop(index=df[filt].index)

                     email     fullname first    last   name
0        janedan@gmail.com     jane dan  jane     dan    NaN
3     adamoliver@email.com  Adam Oliver  Adam  Oliver    NaN
4   tonystark@avengers.com          NaN   NaN   Stark   Tony
5  stevrogers@avengers.com          NaN   NaN  Rogers  steve

In [63]:
##sorting

In [64]:
df.sort_values(by='last',ascending=False)

                     email     fullname  first    last   name
0        janedan@gmail.com     jane dan   jane     dan    NaN
4   tonystark@avengers.com          NaN    NaN   Stark   Tony
5  stevrogers@avengers.com          NaN    NaN  Rogers  steve
3     adamoliver@email.com  Adam Oliver   Adam  Oliver    NaN
1      kylemercy@email.com    mercy Doe  mercy     Doe    NaN
2    janetsamson@gmail.com    janet Doe  janet     Doe    NaN

In [65]:
df.sort_values(by=['last','first'],ascending=False)

                     email     fullname  first    last   name
0        janedan@gmail.com     jane dan   jane     dan    NaN
4   tonystark@avengers.com          NaN    NaN   Stark   Tony
5  stevrogers@avengers.com          NaN    NaN  Rogers  steve
3     adamoliver@email.com  Adam Oliver   Adam  Oliver    NaN
1      kylemercy@email.com    mercy Doe  mercy     Doe    NaN
2    janetsamson@gmail.com    janet Doe  janet     Doe    NaN

In [66]:
#to sort the last in decending and the first in acending
df.sort_values(by=['last','first'], ascending=[False,True],inplace=True)
df

                     email     fullname  first    last   name
0        janedan@gmail.com     jane dan   jane     dan    NaN
4   tonystark@avengers.com          NaN    NaN   Stark   Tony
5  stevrogers@avengers.com          NaN    NaN  Rogers  steve
3     adamoliver@email.com  Adam Oliver   Adam  Oliver    NaN
2    janetsamson@gmail.com    janet Doe  janet     Doe    NaN
1      kylemercy@email.com    mercy Doe  mercy     Doe    NaN

In [67]:
#to sort using the index
df.sort_index()

                     email     fullname  first    last   name
0        janedan@gmail.com     jane dan   jane     dan    NaN
1      kylemercy@email.com    mercy Doe  mercy     Doe    NaN
2    janetsamson@gmail.com    janet Doe  janet     Doe    NaN
3     adamoliver@email.com  Adam Oliver   Adam  Oliver    NaN
4   tonystark@avengers.com          NaN    NaN   Stark   Tony
5  stevrogers@avengers.com          NaN    NaN  Rogers  steve

In [68]:
#to sort a single series
df['last'].sort_values()

2       Doe
1       Doe
3    Oliver
5    Rogers
4     Stark
0       dan
Name: last, dtype: object

In [69]:
import numpy as np
people2 = {'first':['jane','mercy','joy','Adam',np.nan,None,'NA'],
         'last':['dan','stev','stev','Oliver',np.nan,np.nan,'Missing'],
         'email':['janedan@gmail.com','mercystev@gmail.com','joygath@gmail.com',None,np.nan,'Anonymous@email.com','NA'],
          'age':['33','45','63','56',None,None,'Missing']}
gf =pd.DataFrame(people2)
gf

   first     last                email      age
0   jane      dan    janedan@gmail.com       33
1  mercy     stev  mercystev@gmail.com       45
2    joy     stev    joygath@gmail.com       63
3   Adam   Oliver                 None       56
4    NaN      NaN                  NaN     None
5   None      NaN  Anonymous@email.com     None
6     NA  Missing                   NA  Missing

In [70]:
gf.dropna()

   first     last                email      age
0   jane      dan    janedan@gmail.com       33
1  mercy     stev  mercystev@gmail.com       45
2    joy     stev    joygath@gmail.com       63
6     NA  Missing                   NA  Missing

In [71]:
#to check for mising values in a column
gf.dropna(axis='index',how='any',subset=['email'])

   first     last                email      age
0   jane      dan    janedan@gmail.com       33
1  mercy     stev  mercystev@gmail.com       45
2    joy     stev    joygath@gmail.com       63
5   None      NaN  Anonymous@email.com     None
6     NA  Missing                   NA  Missing

In [72]:
gf.dropna(axis='index',how='all',subset=['last','email'])
#this means that the need all the values in last or email complete as long as the have values in this column it wont be droped

   first     last                email      age
0   jane      dan    janedan@gmail.com       33
1  mercy     stev  mercystev@gmail.com       45
2    joy     stev    joygath@gmail.com       63
3   Adam   Oliver                 None       56
5   None      NaN  Anonymous@email.com     None
6     NA  Missing                   NA  Missing

In [73]:
#to replace missing or na with proper nan values
import numpy as np
gf =pd.DataFrame(people2)

gf.replace('NA',np.nan,inplace=True)
gf.replace('Missing',np.nan,inplace=True)

In [74]:
gf

   first    last                email   age
0   jane     dan    janedan@gmail.com    33
1  mercy    stev  mercystev@gmail.com    45
2    joy    stev    joygath@gmail.com    63
3   Adam  Oliver                 None    56
4    NaN     NaN                  NaN  None
5   None     NaN  Anonymous@email.com  None
6    NaN     NaN                  NaN   NaN

In [75]:
#to replace a nan value
gf.fillna('MISSING')

     first     last                email      age
0     jane      dan    janedan@gmail.com       33
1    mercy     stev  mercystev@gmail.com       45
2      joy     stev    joygath@gmail.com       63
3     Adam   Oliver              MISSING       56
4  MISSING  MISSING              MISSING  MISSING
5  MISSING  MISSING  Anonymous@email.com  MISSING
6  MISSING  MISSING              MISSING  MISSING

In [76]:
#OR
gf.fillna(0)

   first    last                email age
0   jane     dan    janedan@gmail.com  33
1  mercy    stev  mercystev@gmail.com  45
2    joy    stev    joygath@gmail.com  63
3   Adam  Oliver                    0  56
4      0       0                    0   0
5      0       0  Anonymous@email.com   0
6      0       0                    0   0

In [77]:
#casting of datatypes
df.dtypes

email       object
fullname    object
first       object
last        object
name        object
dtype: object

In [78]:
type(np.nan)

float

In [79]:
#casting
gf['age'] =gf['age'].astype(float)
gf

   first    last                email   age
0   jane     dan    janedan@gmail.com  33.0
1  mercy    stev  mercystev@gmail.com  45.0
2    joy    stev    joygath@gmail.com  63.0
3   Adam  Oliver                 None  56.0
4    NaN     NaN                  NaN   NaN
5   None     NaN  Anonymous@email.com   NaN
6    NaN     NaN                  NaN   NaN

In [80]:
gf['age'].mean()

49.25